namespace _00.Demo.Animals;

public class Cat : Animal
{
    public Cat(string name, int age) // -> Правим конструктор, който приема параметър name,  
       : base(name, age)        // -> обаче логиката нека да се използва от базовия конструктор
    {

    }

    public  void Meow()
    {

        Console.WriteLine("meowing...");
    }

    // sealed -> ключова дума
    // Може да се слага на метод, който е override.
    // Също така може да се слага на клас(този калас не може да се наследява).
    // По този начин не позволява на следващите наследници да го променят.
    // В някой момент в ерархията когато се реши, че даден метод не трябва
    // да бъде променян повече, се слага sealed!
}